GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32e517z(c-e)xx-pinctrl.h
/* SHRTIMER_ST0CH1 */
#define SHRTIMER_ST0CH1_PA9 \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, NORMP)

/* SHRTIMER_ST1CH0 */
#define SHRTIMER_ST1CH0_PA10 \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)

/* SHRTIMER_ST1CH1 */
#define SHRTIMER_ST1CH1_PA11 \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, NORMP)

/* SHRTIMER_ST2CH0 */
#define SHRTIMER_ST2CH0_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* SHRTIMER_ST2CH1 */
#define SHRTIMER_ST2CH1_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* SHRTIMER_ST3CH0 */
#define SHRTIMER_ST3CH0_PB14 \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, NORMP)

/* SHRTIMER_ST3CH1 */
#define SHRTIMER_ST3CH1_PB15 \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* SHRTIMER_ST4CH0 */
#define SHRTIMER_ST4CH0_PC8 \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, NORMP)
#define SHRTIMER_ST4CH0_PG6 \
	GD32_PINMUX_AFIO('G', 6, ALTERNATE, NORMP)

/* SHRTIMER_ST4CH1 */
#define SHRTIMER_ST4CH1_PC9 \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, NORMP)
#define SHRTIMER_ST4CH1_PG7 \
	GD32_PINMUX_AFIO('G', 7, ALTERNATE, NORMP)

/* SPI0_IO2 */
#define SPI0_IO2_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, SPI0_NORMP)
#define SPI0_IO2_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, SPI0_NORMP)
#define SPI0_IO2_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, SPI0_RMP)

/* SPI0_IO3 */
#define SPI0_IO3_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, SPI0_NORMP)
#define SPI0_IO3_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, SPI0_NORMP)
#define SPI0_IO3_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, SPI0_RMP)

/* SPI0_MISO */
#define SPI0_MISO_PA6_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, SPI0_NORMP)
#define SPI0_MISO_PB4_NORMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI0_NORMP)
#define SPI0_MISO_PB4_RMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI0_RMP)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, SPI0_NORMP)
#define SPI0_MOSI_PB5_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI0_NORMP)
#define SPI0_MOSI_PB5_RMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI0_RMP)

/* SPI0_NSS */
#define SPI0_NSS_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI0_NORMP)
#define SPI0_NSS_PA15_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI0_NORMP)
#define SPI0_NSS_PA15_RMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI0_RMP)

/* SPI0_SCK */
#define SPI0_SCK_PA5_NORMP \
	GD32_PINMUX_AFIO('A', 5, ALTERNATE, SPI0_NORMP)
#define SPI0_SCK_PB3_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI0_NORMP)
#define SPI0_SCK_PB3_RMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI0_RMP)

/* SPI1_MISO */
#define SPI1_MISO_PB14 \
	GD32_PINMUX_AFIO('B', 14, GPIO_IN, NORMP)

/* SPI1_MOSI */
#define SPI1_MOSI_PB15 \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* SPI1_NSS */
#define SPI1_NSS_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* SPI1_SCK */
#define SPI1_SCK_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* SPI2_MISO */
#define SPI2_MISO_PB4_NORMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI2_NORMP)
#define SPI2_MISO_PC11_NORMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, SPI2_NORMP)
#define SPI2_MISO_PC11_RMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, SPI2_RMP)

/* SPI2_MOSI */
#define SPI2_MOSI_PB5_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI2_NORMP)
#define SPI2_MOSI_PC12_NORMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, SPI2_NORMP)
#define SPI2_MOSI_PC12_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, SPI2_RMP)

/* SPI2_NSS */
#define SPI2_NSS_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI2_NORMP)
#define SPI2_NSS_PA4_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI2_RMP)
#define SPI2_NSS_PA15_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI2_NORMP)

/* SPI2_SCK */
#define SPI2_SCK_PB3_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI2_NORMP)
#define SPI2_SCK_PC10_NORMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, SPI2_NORMP)
#define SPI2_SCK_PC10_RMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, SPI2_RMP)

/* SQPI_CLK */
#define SQPI_CLK_PF8 \
	GD32_PINMUX_AFIO('F', 8, ALTERNATE, NORMP)

/* SQPI_CSN */
#define SQPI_CSN_PF6 \
	GD32_PINMUX_AFIO('F', 6, ALTERNATE, NORMP)
#define SQPI_CSN_PG4 \
	GD32_PINMUX_AFIO('G', 4, ALTERNATE, NORMP)

/* SQPI_D0 */
#define SQPI_D0_PF0 \
	GD32_PINMUX_AFIO('F', 0, ALTERNATE, NORMP)

/* SQPI_D1 */
#define SQPI_D1_PF4 \
	GD32_PINMUX_AFIO('F', 4, ALTERNATE, NORMP)
#define SQPI_D1_PG6 \
	GD32_PINMUX_AFIO('G', 6, ALTERNATE, NORMP)

/* SQPI_D2 */
#define SQPI_D2_PF2 \
	GD32_PINMUX_AFIO('F', 2, ALTERNATE, NORMP)
#define SQPI_D2_PG8 \
	GD32_PINMUX_AFIO('G', 8, ALTERNATE, NORMP)

/* SQPI_D3 */
#define SQPI_D3_PF10 \
	GD32_PINMUX_AFIO('F', 10, ALTERNATE, NORMP)

/* TAMPER-RTC */
#define TAMPER-RTC_PC13 \
	GD32_PINMUX_AFIO('C', 13, ALTERNATE, NORMP)

/* TIMER0_BRKIN */
#define TIMER0_BRKIN_PA6_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER0_NORMP)
#define TIMER0_BRKIN_PA6_PRMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER0_PRMP)
#define TIMER0_BRKIN_PB12_NORMP \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, TIMER0_NORMP)
#define TIMER0_BRKIN_PE15_NORMP \
	GD32_PINMUX_AFIO('E', 15, ALTERNATE, TIMER0_NORMP)
#define TIMER0_BRKIN_PE15_FRMP \
	GD32_PINMUX_AFIO('E', 15, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_PA8_PRMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH0_PE9_NORMP \
	GD32_PINMUX_AFIO('E', 9, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_PE9_FRMP \
	GD32_PINMUX_AFIO('E', 9, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH0_ON */
#define TIMER0_CH0_ON_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_ON_PA7_PRMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH0_ON_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_ON_PE8_NORMP \
	GD32_PINMUX_AFIO('E', 8, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_ON_PE8_FRMP \
	GD32_PINMUX_AFIO('E', 8, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_PA9_PRMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH1_PE11_NORMP \
	GD32_PINMUX_AFIO('E', 11, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_PE11_FRMP \
	GD32_PINMUX_AFIO('E', 11, ALTERNATE, TIMER0_FRMP)

