GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32e517z(c-e)xx-pinctrl.h
/* TIMER0_CH1_ON */
#define TIMER0_CH1_ON_PB0_NORMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_ON_PB0_PRMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH1_ON_PB14_NORMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_ON_PE10_NORMP \
	GD32_PINMUX_AFIO('E', 10, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_ON_PE10_FRMP \
	GD32_PINMUX_AFIO('E', 10, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10_NORMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_PA10_PRMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH2_PE13_NORMP \
	GD32_PINMUX_AFIO('E', 13, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_PE13_FRMP \
	GD32_PINMUX_AFIO('E', 13, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH2_ON */
#define TIMER0_CH2_ON_PB1_NORMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_ON_PB1_PRMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH2_ON_PB15_NORMP \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_ON_PE12_NORMP \
	GD32_PINMUX_AFIO('E', 12, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_ON_PE12_FRMP \
	GD32_PINMUX_AFIO('E', 12, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11_NORMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH3_PA11_PRMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH3_PE14_NORMP \
	GD32_PINMUX_AFIO('E', 14, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH3_PE14_FRMP \
	GD32_PINMUX_AFIO('E', 14, ALTERNATE, TIMER0_FRMP)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12_NORMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_NORMP)
#define TIMER0_ETI_PA12_PRMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_PRMP)
#define TIMER0_ETI_PE7_NORMP \
	GD32_PINMUX_AFIO('E', 7, GPIO_IN, TIMER0_NORMP)
#define TIMER0_ETI_PE7_FRMP \
	GD32_PINMUX_AFIO('E', 7, GPIO_IN, TIMER0_FRMP)

/* TIMER10_CH0 */
#define TIMER10_CH0_PB9_NORMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, TIMER10_NORMP)
#define TIMER10_CH0_PF7_RMP \
	GD32_PINMUX_AFIO('F', 7, ALTERNATE, TIMER10_RMP)

/* TIMER12_CH0 */
#define TIMER12_CH0_PA6_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER12_NORMP)
#define TIMER12_CH0_PF8_RMP \
	GD32_PINMUX_AFIO('F', 8, ALTERNATE, TIMER12_RMP)

/* TIMER13_CH0 */
#define TIMER13_CH0_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER13_NORMP)
#define TIMER13_CH0_PF9_RMP \
	GD32_PINMUX_AFIO('F', 9, ALTERNATE, TIMER13_RMP)

/* TIMER14_BRKIN */
#define TIMER14_BRKIN_PA9 \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, NORMP)
#define TIMER14_BRKIN_PC5 \
	GD32_PINMUX_AFIO('C', 5, ALTERNATE, NORMP)

/* TIMER14_CH0 */
#define TIMER14_CH0_PA2 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)
#define TIMER14_CH0_PB14 \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, NORMP)

/* TIMER14_CH0_ON */
#define TIMER14_CH0_ON_PA1 \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, NORMP)
#define TIMER14_CH0_ON_PB15 \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* TIMER14_CH1 */
#define TIMER14_CH1_PA3 \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, NORMP)
#define TIMER14_CH1_PB15 \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* TIMER15_ */
#define TIMER15__PA12 \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)
#define TIMER15__PA13 \
	GD32_PINMUX_AFIO('A', 13, ALTERNATE, NORMP)

/* TIMER15_BRKIN */
#define TIMER15_BRKIN_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* TIMER15_CH0 */
#define TIMER15_CH0_PA6 \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, NORMP)
#define TIMER15_CH0_PB4 \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)
#define TIMER15_CH0_PB8 \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, NORMP)

/* TIMER15_CH0_ON */
#define TIMER15_CH0_ON_PA13 \
	GD32_PINMUX_AFIO('A', 13, ALTERNATE, NORMP)
#define TIMER15_CH0_ON_PB6 \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, NORMP)

/* TIMER16_BRKIN */
#define TIMER16_BRKIN_PA10 \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)
#define TIMER16_BRKIN_PB4 \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)

/* TIMER16_CH0 */
#define TIMER16_CH0_PA7 \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, NORMP)
#define TIMER16_CH0_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)
#define TIMER16_CH0_PB9 \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, NORMP)

/* TIMER16_CH0_ON */
#define TIMER16_CH0_ON_PB7 \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, NORMP)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH0_PA0_PRMP2 \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH0_PA15_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH0_PA15_PRMP1 \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH0_PA15_FRMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH1_PA1_PRMP2 \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH1_PB3_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH1_PB3_PRMP1 \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH1_PB3_FRMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH2_PA2_PRMP1 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH2_PB10_NORMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH2_PB10_PRMP2 \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH2_PB10_FRMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH3_PA3_PRMP1 \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH3_PB11_NORMP \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH3_PB11_PRMP2 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH3_PB11_FRMP \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, TIMER1_FRMP)

/* TIMER1_ETI */
#define TIMER1_ETI_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_NORMP)
#define TIMER1_ETI_PA0_PRMP2 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_ETI_PA15_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_NORMP)
#define TIMER1_ETI_PA15_PRMP1 \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_ETI_PA15_FRMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_FRMP)

